docs/posts/2016-11-10-love-one-another.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 28, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>After the Election — Love</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">After the Election — Love</h1>
<p class="subtitle" role="doc-subtitle">Nov 10, 2016</p>
</header><p>
There are circumstances during which my failure becomes clearly evident, and the events of the past few days have given me needed opportunity to reflect on that failure.
</p>

<p>
God&rsquo;s commandment is to love — a commandment given not to an abstract entity such as government or the church, but a commandment given to me.
</p>

<p>
Even more, God commanded me to love my neighbor — not the world or humanity, but my neighbor, the one who weeps in fear and pain, the one who offends me, the one with whom I disagree, and the one of whom I take no notice.
</p>

<p>
May God have mercy on me, a sinner.
</p>

<p>
God who sustains us,
</p>

<p>
If we are to rejoice together,<br>
may we taste the strength<br>
of your justice and peace.<br>
</p>

<p>
If we are to suffer together,<br>
may we drink deeply<br>
from your sacred tears.<br>
</p>

<p>
If we are to live together,<br>
may we feast on your love,<br>
knowing that there is one rule<br>
at the table of the Lord:
</p>

<p>
&ldquo;Little children, love one another.&rdquo;
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="org1087230">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 28, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
